In [1]:
import pandas as pd
from pandas import read_sql
# SQL Alchemy
from sqlalchemy import create_engine

In [4]:
emp_db = create_engine('postgresql://postgres:postgres@localhost:5432/employee_hist').connect()

In [8]:
emp_data = pd.read_sql("select * from employees", emp_db)
salary_data = pd.read_sql("select * from salaries", emp_db)
title_data = pd.read_sql("select * from titles", emp_db)

In [11]:
emp_data.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [9]:
salary_data.head()

   salary_ID emp_no  salary
0          1  10001   60117
1          2  10002   65828
2          3  10003   40006
3          4  10004   40054
4          5  10005   78228

In [10]:
title_data.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [14]:
emp_title=pd.merge(emp_data,title_data,how='inner',left_on='emp_title_id',right_on='title_id')
emp_title.head()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,title_id,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,s0001,Staff
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,s0001,Staff
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,s0001,Staff
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,s0001,Staff
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,s0001,Staff

In [ ]:
emp_title_salary=pd.merge(emp_title,salary_data,how='inner',on='emp_no').dropna()
emp_title_salary.head()

In [19]:
emp_title_salary.dropna()

,emp_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,title_id,title,salary_ID,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,s0001,Staff,273327,40000
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,s0001,Staff,221811,40000
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,s0001,Staff,173512,56087
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,s0001,Staff,146474,87084
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,s0001,Staff,38085,63016
...,...,...,...,...,...,...,...,...,...,...,...
300019,111400,m0001,1959-11-09,Arie,Staelin,M,1985-01-01,m0001,Manager,100019,72446
300020,111133,m0001,1955-03-16,Hauke,Zhang,M,1986-12-30,m0001,Manager,100018,71148
300021,110085,m0001,1959-10-28,Ebru,Alpin,M,1985-01-01,m0001,Manager,100003,60026
300022,110386,m0001,1953-10-04,Shem,Kieras,M,1988-10-14,m0001,Manager,100009,40000
300023,111784,m0001,1956-06-14,Marjo,Giarratana,F,1988-02-12,m0001,Manager,100022,40000